In [113]:
import csv
import pandas as pd

In [114]:
pwd

'/Users/cheryl/Dropbox/2_AI/6_data_incu/milestone'

In [115]:
file = 'Value_of_Energy_Cost_Savings_Program_Savings_for_Businesses_20240108.csv'

In [116]:
df = pd.read_csv(file)

In [117]:
type(df)

pandas.core.frame.DataFrame

In [118]:
df.shape

(2363, 30)

In [119]:
df.columns

Index(['Period', 'Company Name', 'company contact', 'company email',
       'company phone', 'Address', 'City', 'State', 'Postcode', 'Industry',
       'Industry descr', 'Company Type', 'Current fulltime', 'Job created',
       'Job retain', 'Effective Date', 'Total Savings',
       'Savings from beginning receiving benefits', 'Gas Savings',
       'Cogen savings', 'Electric Savings', 'Borough', 'Latitude', 'Longitude',
       'Community Board', 'Council District', 'BIN', 'BBL',
       'Census Tract (2020)', 'Neighborhood Tabulation Area (NTA) (2020)'],
      dtype='object')

In [120]:
df.head(2)

,Period,Company Name,company contact,company email,company phone,Address,City,State,Postcode,Industry,...,Electric Savings,Borough,Latitude,Longitude,Community Board,Council District,BIN,BBL,Census Tract (2020),Neighborhood Tabulation Area (NTA) (2020)
0,FY2018,"139 ACA Realty, Inc.",Eitan Chandally,barbara@dial7.com,7187076123,43-23 35th Street,Long Island City,NY,11101,Commercial,...,NaN,QUEENS,40.745706,-73.929565,402.0,26.0,4003160.0,4.002220e+09,17902.0,QN0202
1,FY2018,"141 Lake Avenue Realty c/o JR Produce, Inc.",Josef Raz,jrproduce@gmail.com,7183708782,141 Lake Avenue,Staten Island,NY,10303,Wholesale/Warehouse/Distribution,...,NaN,STATEN IS,40.632845,-74.151048,501.0,49.0,5146740.0,5.011610e+09,239.0,SI0107

### 1. How many different companies are represented in the data set?

In [121]:
df['Company Name'].nunique()

787

### 2. What is the total number of jobs created for businesses in Queens?

In [124]:
df[df.City == 'Queens']['Job created'].sum()

12257.0

### 3. How many different unique email domains names are there in the data set?

In [130]:
df['company email'].str.split('@').str[1].nunique()

591

### 4. Considering only NTAs with at least 5 listed businesses, what is the average total savings and the total jobs created for each NTA?

In [157]:
df = df.rename(columns = {'Neighborhood Tabulation Area (NTA) (2020)':'NTA'})

In [174]:
df[['NTA','Company Name']].groupby('NTA').nunique().reset_index()

       NTA  Company Name
0   BK0101            38
1   BK0102             3
2   BK0103             2
3   BK0104            30
4   BK0201             4
..     ...           ...
92  SI0106             3
93  SI0107             4
94  SI0204             3
95  SI0303             1
96  SI0305             1

[97 rows x 2 columns]